jerarddahuyag-code/STM32-projects/Tracker/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOA
#define DIP_SW_2_Pin GPIO_PIN_1
#define DIP_SW_2_GPIO_Port GPIOA
#define VCP_TX_Pin GPIO_PIN_2
#define VCP_TX_GPIO_Port GPIOA
#define RED_LED_Pin GPIO_PIN_4
#define RED_LED_GPIO_Port GPIOA
#define DIP_SW_3_Pin GPIO_PIN_8
#define DIP_SW_3_GPIO_Port GPIOA
#define DIP_SW_4_Pin GPIO_PIN_11
#define DIP_SW_4_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define VCP_RX_Pin GPIO_PIN_15
#define VCP_RX_GPIO_Port GPIOA
#define DIP_SW_1_Pin GPIO_PIN_3
#define DIP_SW_1_GPIO_Port GPIOB
#define GREEN_LED_Pin GPIO_PIN_4
#define GREEN_LED_GPIO_Port GPIOB
#define YELLOW_LED_Pin GPIO_PIN_5
#define YELLOW_LED_GPIO_Port GPIOB
#define BUTTON_Pin GPIO_PIN_7
#define BUTTON_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
// SPI Chip Select (NSS)
#define LORA_NSS_Pin GPIO_PIN_0
#define LORA_NSS_GPIO_Port GPIOB

// Radio Reset
#define LORA_RST_Pin GPIO_PIN_12  // If you have a reset pin connected
#define LORA_RST_GPIO_Port GPIOA // Adjust if Reset is on a different pin

// LoRa Interrupts (Crucial for 16 trackers)
#define LORA_DIO0_Pin GPIO_PIN_1
#define LORA_DIO0_GPIO_Port GPIOB

#define LORA_DIO1_Pin GPIO_PIN_6
#define LORA_DIO1_GPIO_Port GPIOB
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
